app/Controllers/AtencionController.php

SELECT *
FROM `atencion`
---
    public function index()
    {
        return view('atencion/index', ['items' => $this->model->findAll()]);