app/Controllers/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `personal`
SELECT COUNT(*) AS `numrows`
FROM `serviciosmedicos`
---
    public function index()
    {
        $db = \Config\Database::connect();

        $data = [
            'total_patients'     => (new PatientModel())->countAllResults(),
            'total_appointments' => (new AppointmentModel())->countAll(),
            'total_servicios'    => $db->table('serviciosmedicos')->countAllResults(),
            'total_personal'     => $db->table('personal')->countAllResults(),
        ];