app/Controllers/PersonalController.php

    public function index()
    {
        return view('personal/index', ['items' => $this->model->findAll()]);
---
SELECT *
FROM `personal`