app/Controllers/SistemaController.php

SELECT *
FROM `sistema`
---
    public function index()
    {
        return view('sistema/index', ['items' => $this->model->findAll()]);