app/Models/AppointmentModel.php

    public function countByDoctor(int $doctorId): int
    {
        return $this->db->table('citas')->where('idMedico_cit', $doctorId)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `citas`
WHERE `idMedico_cit` = 99