app/Models/PersonalModel.php

    public function findByUsername(string $username): ?array
    {
        return $this->where('username_per', $username)->first();
---
SELECT *
FROM `personal`
WHERE `username_per` = 'Usuario'
 LIMIT 1